readme.md revised again and again.
